In [1]:
import pandas as pd

In [2]:
#!pip3 install xlrd
# To read xlsx files

Collecting xlrd
  Downloading xlrd-2.0.1-py2.py3-none-any.whl (96 kB)
     |████████████████████████████████| 96 kB 3.4 MB/s eta 0:00:01
Installing collected packages: xlrd
Successfully installed xlrd-2.0.1

In [3]:
#!pip3 install openpyxl
# To write into xlsx files

Collecting openpyxl
  Downloading openpyxl-3.0.7-py2.py3-none-any.whl (243 kB)
     |████████████████████████████████| 243 kB 5.7 MB/s eta 0:00:01
Collecting et-xmlfile
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.0.7

In [5]:
weather_data = [('1/1/2017', 32, 6, 'Rain'),
                ('4/4/2017', 39, 2, 'Rain'),
                ('6/3/2017', 33, 7, 'Snow'),
                ('3/12/2017', 28, 6, 'Sunny')
               ]
df = pd.DataFrame(weather_data, columns=['day', 'temperature', 'windspeed', 'event'])
df

         day  temperature  windspeed  event
0   1/1/2017           32          6   Rain
1   4/4/2017           39          2   Rain
2   6/3/2017           33          7   Snow
3  3/12/2017           28          6  Sunny

In [6]:
df.to_csv('new.csv') # It also stores Index numbers as comman seperated

In [8]:
df.to_csv('newWithoutIndex.csv', index=False)

In [9]:
df.to_excel('new.xlsx', sheet_name='weather_data')

In [10]:
g = df.groupby('event')
g

In [11]:
for event, event_df in g:
    print(event)
    print(event_df)

Rain
        day  temperature  windspeed event
0  1/1/2017           32          6  Rain
1  4/4/2017           39          2  Rain
Snow
        day  temperature  windspeed event
2  6/3/2017           33          7  Snow
Sunny
         day  temperature  windspeed  event
3  3/12/2017           28          6  Sunny

In [12]:
g.get_group('Rain')

        day  temperature  windspeed event
0  1/1/2017           32          6  Rain
1  4/4/2017           39          2  Rain

In [13]:
print(g.max()) # get max numerical attribute for each event by removing duplicate values

             day  temperature  windspeed
event
Rain    4/4/2017           39          6
Snow    6/3/2017           33          7
Sunny  3/12/2017           28          6

In [14]:
print(g.mean())

       temperature  windspeed
event
Rain          35.5        4.0
Snow          33.0        7.0
Sunny         28.0        6.0

In [15]:
print(g.describe())

      temperature                                                 windspeed  \
            count  mean       std   min    25%   50%    75%   max     count
event
Rain          2.0  35.5  4.949747  32.0  33.75  35.5  37.25  39.0       2.0
Snow          1.0  33.0       NaN  33.0  33.00  33.0  33.00  33.0       1.0
Sunny         1.0  28.0       NaN  28.0  28.00  28.0  28.00  28.0       1.0


      mean       std  min  25%  50%  75%  max
event
Rain   4.0  2.828427  2.0  3.0  4.0  5.0  6.0
Snow   7.0       NaN  7.0  7.0  7.0  7.0  7.0
Sunny  6.0       NaN  6.0  6.0  6.0  6.0  6.0

In [16]:
india_weather=pd.DataFrame({
    "city": ["mumbai", "delhi", "bangalore"],
    "temperature" : [32, 45, 30],
    "humidity": [80, 60, 78]
})

india_weather

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78

In [17]:
us_weather=pd.DataFrame({
    "city": ["newyork", "california", "chicago"],
    "temperature" : [33, 48, 21],
    "humidity": [70, 40, 33]
})

us_weather

         city  temperature  humidity
0     newyork           33        70
1  california           48        40
2     chicago           21        33

In [18]:
df = pd.concat([india_weather, us_weather])
df

         city  temperature  humidity
0      mumbai           32        80
1       delhi           45        60
2   bangalore           30        78
0     newyork           33        70
1  california           48        40
2     chicago           21        33

In [20]:
df = pd.concat([india_weather, us_weather], ignore_index=True)
df

         city  temperature  humidity
0      mumbai           32        80
1       delhi           45        60
2   bangalore           30        78
3     newyork           33        70
4  california           48        40
5     chicago           21        33

In [21]:
df = pd.concat([india_weather, us_weather], ignore_index=True, axis=1)
df

           0   1   2           3   4   5
0     mumbai  32  80     newyork  33  70
1      delhi  45  60  california  48  40
2  bangalore  30  78     chicago  21  33

In [25]:
india_temp=pd.DataFrame({
    "city": ["mumbai", "delhi", "bangalore"],
    "temperature" : [32, 45, 30]
})

In [27]:
india_humidity=pd.DataFrame({
    "city": ["mumbai", "delhi", "bangalore", "hyderabad"],
    "humidity": [80, 60, 78, 23]
})

In [28]:
# INNER JOIN
# merge will drom hyderabad as it is not present in temperature dataframe
df = pd.merge(india_temp, india_humidity, on='city')
df

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78

In [30]:
# OUTER JOIN
# if want to join hyderabad .. need to perform OUTER Join

df = pd.merge(india_temp, india_humidity, on='city', how='outer')
df

        city  temperature  humidity
0     mumbai         32.0        80
1      delhi         45.0        60
2  bangalore         30.0        78
3  hyderabad          NaN        23

In [31]:
# Defining Custom Indices
df = pd.DataFrame([1,2,3,4,5,6,7,8, 9, 10], index=[23, 34, 44, 21, 1, 3, 4, 5, 7, 9])
df

     0
23   1
34   2
44   3
21   4
1    5
3    6
4    7
5    8
7    9
9   10

In [43]:
# By default Indices match with row numbers as 0 to sizeof(df)-1
# Data can be accessed in two ways, either based on indices or based on row Numbers

print(df.loc[44])   # find the values by index number 44
print(df.iloc[4])  # find the values by row number 4 ( which is 5th row)

0    3
Name: 44, dtype: int64
0    5
Name: 1, dtype: int64

In [48]:
print(df.loc[:3]) # print df till it finds the index number 3 and exclude index 3
print("*****")
print(df.iloc[:3]) # print df till the row number 3-1 (just before 4th row, so only 3 rows)

    0
23  1
34  2
44  3
21  4
1   5
3   6
*****
    0
23  1
34  2
44  3